In [4]:
import pandas as pd
sales = pd.read_csv('sales.csv')
sales.head(10)

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
0,460489604,1/25/2018,16:46,Male,Brookfield,NewYork,Yes,Groceries,30,1,30,Cash,2
1,471006167,3/19/2018,16:48,Female,Water tower,Chicago,Yes,Fashion,35,5,175,Card,3
2,411909258,2/25/2018,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
3,487313402,1/22/2018,13:38,Female,Park lane,Dallas,Yes,Sporting,89,4,356,Gpay,1
4,197763430,2/18/2018,15:31,Female,Park lane,Dallas,No,Books,82,5,410,Cash,4
5,263634050,3/9/2018,17:55,Male,Brookfield,NewYork,Yes,Clothing,52,4,208,Gpay,3
6,99646662,3/4/2018,13:21,Male,Water tower,Chicago,No,Clothing,81,3,243,Cash,4
7,188869875,3/8/2018,13:24,Male,Park lane,Dallas,No,Books,80,2,160,Cash,3
8,325637547,1/18/2018,15:33,Male,Park lane,Dallas,Yes,Clothing,91,3,273,Card,3
9,562942936,2/24/2018,16:05,Female,Park lane,Dallas,No,Books,80,2,160,Cash,4

In [3]:
sales['Invoice ID']

0      460489604
1      471006167
2      411909258
3      487313402
4      197763430
         ...
995    818829599
996    556589713
997     82324424
998    783661702
999    759171975
Name: Invoice ID, Length: 1000, dtype: int64

In [5]:
sales['Category'].unique()

array(['Groceries', 'Fashion', 'Clothing', 'Sporting', 'Books',
       'Furniture'], dtype=object)

In [7]:
sales.iloc[200]

Invoice ID      576523018
Date            2/15/2018
Time                12:35
Gender               Male
Location      Water tower
City              Chicago
Member                 No
Category        Groceries
Price                  82
Quantity                1
Total                  82
Payment              Card
Rating                  4
Name: 200, dtype: object

In [8]:
sales[200:210]

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
200,576523018,2/15/2018,12:35,Male,Water tower,Chicago,No,Groceries,82,1,82,Card,4
201,414119922,1/30/2018,11:07,Male,Water tower,Chicago,No,Sporting,44,7,308,Card,3
202,123247697,2/8/2018,20:03,Male,Brookfield,NewYork,No,Groceries,22,7,154,Card,5
203,40419058,1/26/2018,14:53,Male,Water tower,Chicago,Yes,Books,95,6,570,Card,1
204,890497298,2/25/2018,18:06,Female,Water tower,Chicago,No,Clothing,69,2,138,Cash,2
205,885702268,1/28/2018,12:45,Male,Brookfield,NewYork,No,Groceries,89,6,534,Card,1
206,172252194,3/22/2018,20:10,Female,Park lane,Dallas,No,Books,41,6,246,Card,4
207,866140211,2/25/2018,13:34,Female,Park lane,Dallas,No,Clothing,54,6,324,Gpay,4
208,597678548,3/15/2018,17:35,Male,Water tower,Chicago,Yes,Sporting,34,3,102,Cash,1
209,428818456,2/25/2018,18:50,Male,Park lane,Dallas,Yes,Books,94,5,470,Cash,2

In [13]:
sales[sales['Gender']=='Male'].head(10)

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
0,460489604,1/25/2018,16:46,Male,Brookfield,NewYork,Yes,Groceries,30,1,30,Cash,2
2,411909258,2/25/2018,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
5,263634050,3/9/2018,17:55,Male,Brookfield,NewYork,Yes,Clothing,52,4,208,Gpay,3
6,99646662,3/4/2018,13:21,Male,Water tower,Chicago,No,Clothing,81,3,243,Cash,4
7,188869875,3/8/2018,13:24,Male,Park lane,Dallas,No,Books,80,2,160,Cash,3
8,325637547,1/18/2018,15:33,Male,Park lane,Dallas,Yes,Clothing,91,3,273,Card,3
11,846531724,3/15/2018,12:12,Male,Park lane,Dallas,No,Sporting,22,5,110,Card,4
12,149894432,1/12/2018,11:12,Male,Park lane,Dallas,No,Clothing,77,5,385,Cash,4
17,90524319,3/19/2018,18:18,Male,Park lane,Dallas,Yes,Clothing,23,1,23,Cash,3
19,729486362,3/7/2018,12:50,Male,Water tower,Chicago,No,Groceries,39,4,156,Cash,3

In [5]:
sales[sales['Total']>100].head(10)

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
1,471006167,3/19/2018,16:48,Female,Water tower,Chicago,Yes,Fashion,35,5,175,Card,3
2,411909258,2/25/2018,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
3,487313402,1/22/2018,13:38,Female,Park lane,Dallas,Yes,Sporting,89,4,356,Gpay,1
4,197763430,2/18/2018,15:31,Female,Park lane,Dallas,No,Books,82,5,410,Cash,4
5,263634050,3/9/2018,17:55,Male,Brookfield,NewYork,Yes,Clothing,52,4,208,Gpay,3
6,99646662,3/4/2018,13:21,Male,Water tower,Chicago,No,Clothing,81,3,243,Cash,4
7,188869875,3/8/2018,13:24,Male,Park lane,Dallas,No,Books,80,2,160,Cash,3
8,325637547,1/18/2018,15:33,Male,Park lane,Dallas,Yes,Clothing,91,3,273,Card,3
9,562942936,2/24/2018,16:05,Female,Park lane,Dallas,No,Books,80,2,160,Cash,4
10,388412668,2/26/2018,11:32,Female,Brookfield,NewYork,No,Furniture,35,4,140,Gpay,4

In [6]:
sales['Payment'].unique()

array(['Cash', 'Card', 'Gpay'], dtype=object)

In [7]:
sales[sales['Payment']=='Cash']

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
0,460489604,1/25/2018,16:46,Male,Brookfield,NewYork,Yes,Groceries,30,1,30,Cash,2
2,411909258,2/25/2018,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
4,197763430,2/18/2018,15:31,Female,Park lane,Dallas,No,Books,82,5,410,Cash,4
6,99646662,3/4/2018,13:21,Male,Water tower,Chicago,No,Clothing,81,3,243,Cash,4
7,188869875,3/8/2018,13:24,Male,Park lane,Dallas,No,Books,80,2,160,Cash,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...
989,941364541,3/13/2018,14:53,Female,Brookfield,NewYork,No,Sporting,19,7,133,Cash,1
990,752407865,1/15/2018,10:01,Male,Water tower,Chicago,Yes,Clothing,25,4,100,Cash,5
993,455112063,3/19/2018,17:30,Female,Brookfield,NewYork,Yes,Clothing,3,3,9,Cash,2
994,446582560,1/31/2018,19:00,Male,Water tower,Chicago,No,Fashion,29,5,145,Cash,4
998,783661702,1/29/2018,15:44,Female,Brookfield,NewYork,No,Clothing,89,7,623,Cash,5

In [9]:
sales.query('200>Total>100')

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
1,471006167,3/19/2018,16:48,Female,Water tower,Chicago,Yes,Fashion,35,5,175,Card,3
2,411909258,2/25/2018,13:33,Male,Water tower,Chicago,No,Clothing,57,2,114,Cash,5
7,188869875,3/8/2018,13:24,Male,Park lane,Dallas,No,Books,80,2,160,Cash,3
9,562942936,2/24/2018,16:05,Female,Park lane,Dallas,No,Books,80,2,160,Cash,4
10,388412668,2/26/2018,11:32,Female,Brookfield,NewYork,No,Furniture,35,4,140,Gpay,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
977,614557665,3/22/2018,17:16,Female,Park lane,Dallas,No,Clothing,49,3,147,Cash,5
981,418253101,3/14/2018,12:25,Female,Brookfield,NewYork,No,Fashion,81,2,162,Gpay,5
989,941364541,3/13/2018,14:53,Female,Brookfield,NewYork,No,Sporting,19,7,133,Cash,1
994,446582560,1/31/2018,19:00,Male,Water tower,Chicago,No,Fashion,29,5,145,Cash,4
995,818829599,3/26/2018,11:19,Male,Park lane,Dallas,No,Groceries,31,4,124,Card,3

In [17]:
sales.query('Payment=="Cash" & City=="Dallas" & Total<50')

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
17,90524319,3/19/2018,18:18,Male,Park lane,Dallas,Yes,Clothing,23,1,23,Cash,3
75,437093770,2/7/2018,16:42,Female,Park lane,Dallas,Yes,Sporting,4,1,4,Cash,2
133,9436913,1/27/2018,14:26,Female,Park lane,Dallas,No,Groceries,9,4,36,Cash,2
291,85210798,2/28/2018,12:27,Female,Park lane,Dallas,Yes,Books,23,2,46,Cash,5
298,601235443,3/21/2018,10:11,Female,Park lane,Dallas,Yes,Clothing,6,4,24,Cash,5
362,236780335,3/24/2018,20:51,Female,Park lane,Dallas,No,Clothing,7,7,49,Cash,5
396,73853764,1/26/2018,19:06,Female,Park lane,Dallas,Yes,Sporting,12,2,24,Cash,1
479,648584786,2/2/2018,15:10,Male,Park lane,Dallas,Yes,Furniture,3,3,9,Cash,5
516,317999524,2/16/2018,15:04,Female,Park lane,Dallas,Yes,Clothing,7,3,21,Cash,4
556,106779665,2/11/2018,11:20,Female,Park lane,Dallas,No,Sporting,16,2,32,Cash,5
587,646176653,3/10/2018,19:39,Male,Park lane,Dallas,Yes,Sporting,1,1,1,Cash,2
639,135768329,1/4/2018,19:24,Female,Park lane,Dallas,No,Sporting,8,2,16,Cash,1
699,404017492,2/26/2018,13:53,Female,Park lane,Dallas,No,Fashion,23,1,23,Cash,2
721,928380831,2/10/2018,12:24,Male,Park lane,Dallas,Yes,Fashion,1,7,7,Cash,2
737,855506655,1/23/2018,13:22,Male,Park lane,Dallas,No,Sporting,16,2,32,Cash,4
773,801096383,1/22/2018,14:24,Female,Park lane,Dallas,No,Fashion,2,2,4,Cash,5
775,96360197,3/20/2018,12:43,Female,Park lane,Dallas,No,Furniture,4,2,8,Cash,4
820,315410869,2/19/2018,16:23,Male,Park lane,Dallas,No,Fashion,3,3,9,Cash,4
880,658692054,1/29/2018,19:14,Male,Park lane,Dallas,No,Clothing,2,7,14,Cash,1
922,526803787,2/2/2018,10:54,Female,Park lane,Dallas,No,Furniture,20,2,40,Cash,4
933,767705654,1/30/2018,11:15,Male,Park lane,Dallas,No,Books,35,1,35,Cash,2
976,497734676,2/9/2018,14:14,Male,Park lane,Dallas,No,Sporting,5,4,20,Cash,3

In [18]:
sales.sum()['Total']

207788

In [19]:
sales.sum()['Quantity']

4059

In [20]:
sales.max()['Total']

693

In [21]:
sales[sales['Total']==sales.max()['Total']]

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
47,315624039,3/30/2018,19:45,Female,Water tower,Chicago,Yes,Groceries,99,7,693,Gpay,3
679,270918350,3/27/2018,13:21,Female,Park lane,Dallas,Yes,Groceries,99,7,693,Gpay,2

In [22]:
sales.min()['Total']

1

In [23]:
sales[sales['Total']==sales.min()['Total']]

,Invoice ID,Date,Time,Gender,Location,City,Member,Category,Price,Quantity,Total,Payment,Rating
184,801334050,1/21/2018,20:18,Female,Park lane,Dallas,No,Furniture,1,1,1,Gpay,2
587,646176653,3/10/2018,19:39,Male,Park lane,Dallas,Yes,Sporting,1,1,1,Cash,2

In [24]:
sales.mean()['Total']

207.788

In [25]:
sales.mean()['Quantity']

4.059

In [27]:
prom = sales.mean()['Total']/sales.mean()['Quantity']

In [29]:
print(prom*sales.sum()['Quantity'])
print(sales.sum()['Total'])

207788.0
207788